Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Inc/py32e407_hal_spi.h
  __IO uint32_t              ErrorCode;      /*!< SPI Error code                           */

#if (USE_HAL_SPI_REGISTER_CALLBACKS == 1U)
  void (* TxCpltCallback)(struct __SPI_HandleTypeDef *hspi);             /*!< SPI Tx Completed callback              */
  void (* RxCpltCallback)(struct __SPI_HandleTypeDef *hspi);             /*!< SPI Rx Completed callback              */
  void (* TxRxCpltCallback)(struct __SPI_HandleTypeDef *hspi);           /*!< SPI TxRx Completed callback            */
  void (* TxBlockCpltCallback)(struct __SPI_HandleTypeDef *hspi);        /*!< SPI Tx Block Completed callback        */
  void (* TxHalfBlockCpltCallback)(struct __SPI_HandleTypeDef *hspi);    /*!< SPI Tx Half Block Completed callback   */
  void (* TxSrcCpltCallback)(struct __SPI_HandleTypeDef *hspi);          /*!< SPI Tx Source Completed callback       */
  void (* RxBlockCpltCallback)(struct __SPI_HandleTypeDef *hspi);        /*!< SPI Rx Block Completed callback        */
  void (* RxHalfBlockCpltCallback)(struct __SPI_HandleTypeDef *hspi);    /*!< SPI Rx Half Block Completed callback   */
  void (* RxDstCpltCallback)(struct __SPI_HandleTypeDef *hspi);          /*!< SPI Rx Destination Completed callback  */
  void (* TxRxBlockCpltCallback)(struct __SPI_HandleTypeDef *hspi);      /*!< SPI TxRx Block Completed callback      */
  void (* TxRxHalfBlockCpltCallback)(struct __SPI_HandleTypeDef *hspi);  /*!< SPI TxRx Half Block Completed callback */
  void (* TxRxSrcCpltCallback)(struct __SPI_HandleTypeDef *hspi);        /*!< SPI TxRx Source Completed callback     */
  void (* TxRxDstCpltCallback)(struct __SPI_HandleTypeDef *hspi);        /*!< SPI TxRx Destination Completed callback*/
  void (* ErrorCallback)(struct __SPI_HandleTypeDef *hspi);              /*!< SPI Error callback                     */
  void (* AbortCpltCallback)(struct __SPI_HandleTypeDef *hspi);          /*!< SPI Abort callback                     */
  void (* MspInitCallback)(struct __SPI_HandleTypeDef *hspi);            /*!< SPI Msp Init callback                  */
  void (* MspDeInitCallback)(struct __SPI_HandleTypeDef *hspi);          /*!< SPI Msp DeInit callback                */

#endif  /* USE_HAL_SPI_REGISTER_CALLBACKS */
} SPI_HandleTypeDef;

#if (USE_HAL_SPI_REGISTER_CALLBACKS == 1U)
/**
  * @brief  HAL SPI Callback ID enumeration definition
  */
typedef enum
{
  HAL_SPI_TX_COMPLETE_CB_ID               = 0x00U,    /*!< SPI Tx Completed callback ID               */
  HAL_SPI_TX_BLOCK_COMPLETE_CB_ID         = 0x01U,    /*!< SPI Tx Block Completed callback ID         */
  HAL_SPI_TX_HALF_BLOCK_COMPLETE_CB_ID    = 0x02U,    /*!< SPI Tx Half Block Completed callback ID    */
  HAL_SPI_TX_SRC_COMPLETE_CB_ID           = 0x03U,    /*!< SPI Tx Source Completed callback ID        */
  HAL_SPI_RX_COMPLETE_CB_ID               = 0x04U,    /*!< SPI Rx Completed callback ID               */
  HAL_SPI_RX_BLOCK_COMPLETE_CB_ID         = 0x05U,    /*!< SPI Rx Block Completed callback ID         */
  HAL_SPI_RX_HALF_BLOCK_COMPLETE_CB_ID    = 0x06U,    /*!< SPI Rx Half Block Completed callback ID    */
  HAL_SPI_RX_DST_COMPLETE_CB_ID           = 0x07U,    /*!< SPI Rx Destination Completed callback ID   */
  HAL_SPI_TX_RX_COMPLETE_CB_ID            = 0x08U,    /*!< SPI TxRx Completed callback ID             */
  HAL_SPI_TX_RX_BLOCK_COMPLETE_CB_ID      = 0x09U,    /*!< SPI TxRx Block Completed callback ID       */
  HAL_SPI_TX_RX_HALF_BLOCK_COMPLETE_CB_ID = 0x0AU,    /*!< SPI TxRx Half Block Completed callback ID  */
  HAL_SPI_TX_RX_SRC_COMPLETE_CB_ID        = 0x0BU,    /*!< SPI TxRx Source Completed callback ID      */
  HAL_SPI_TX_RX_DST_COMPLETE_CB_ID        = 0x0CU,    /*!< SPI TxRx Destination Completed callback ID */
  HAL_SPI_ERROR_CB_ID                     = 0x0DU,    /*!< SPI Error callback ID                      */
  HAL_SPI_ABORT_CB_ID                     = 0x0EU,    /*!< SPI Abort callback ID                      */
  HAL_SPI_MSPINIT_CB_ID                   = 0x0FU,    /*!< SPI Msp Init callback ID                   */
  HAL_SPI_MSPDEINIT_CB_ID                 = 0x10U     /*!< SPI Msp DeInit callback ID                 */

} HAL_SPI_CallbackIDTypeDef;

/**
  * @brief  HAL SPI Callback pointer definition
  */
typedef  void (*pSPI_CallbackTypeDef)(SPI_HandleTypeDef *hspi); /*!< pointer to an SPI callback function */

#endif /* USE_HAL_SPI_REGISTER_CALLBACKS */
/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/
/** @defgroup SPI_Exported_Constants SPI Exported Constants
  * @{
  */

/** @defgroup SPI_Error_Code SPI Error Code
  * @{
  */
#define HAL_SPI_ERROR_NONE              (0x00000000U)   /*!< No error                               */
#define HAL_SPI_ERROR_MODF              (0x00000001U)   /*!< MODF error                             */
#define HAL_SPI_ERROR_CRC               (0x00000002U)   /*!< CRC error                              */
#define HAL_SPI_ERROR_OVR               (0x00000004U)   /*!< OVR error                              */
#define HAL_SPI_ERROR_FRE               (0x00000008U)   /*!< FRE error                              */
#define HAL_SPI_ERROR_DMA               (0x00000010U)   /*!< DMA transfer error                     */
#define HAL_SPI_ERROR_FLAG              (0x00000020U)   /*!< Error on RXNE/TXE/BSY/FTLVL/FRLVL Flag */
#define HAL_SPI_ERROR_ABORT             (0x00000040U)   /*!< Error during SPI Abort procedure       */
#if (USE_HAL_SPI_REGISTER_CALLBACKS == 1U)
#define HAL_SPI_ERROR_INVALID_CALLBACK  (0x00000080U)   /*!< Invalid Callback error                 */
#endif /* USE_HAL_SPI_REGISTER_CALLBACKS */
/**
  * @}
  */

/** @defgroup SPI_Mode SPI Mode
  * @{
  */
#define SPI_MODE_SLAVE                  (0x00000000U)
#define SPI_MODE_MASTER                 (SPI_CR1_MSTR | SPI_CR1_SSI)
/**
  * @}
  */

/** @defgroup SPI_Direction SPI Direction Mode
  * @{
  */
#define SPI_DIRECTION_2LINES            (0x00000000U)     /* Full-duplex communication or Simpex communication Transmit-only mode */
#define SPI_DIRECTION_2LINES_RXONLY     SPI_CR1_RXONLY    /* Simpex communication Receive-only mode */
#define SPI_DIRECTION_1LINE             SPI_CR1_BIDIMODE  /* Half-duplex communication mode */
/**
  * @}
  */

/** @defgroup SPI_Data_Size SPI Data Size
  * @{
  */
#define SPI_DATASIZE_8BIT               (0x00000700U)
#define SPI_DATASIZE_16BIT              (0x00000F00U)
/**
  * @}
  */

/** @defgroup SPI_Clock_Polarity SPI Clock Polarity
  * @{
  */
#define SPI_POLARITY_LOW                (0x00000000U)
#define SPI_POLARITY_HIGH               SPI_CR1_CPOL
/**
  * @}
  */

/** @defgroup SPI_Clock_Phase SPI Clock Phase
  * @{
  */
#define SPI_PHASE_1EDGE                 (0x00000000U)
#define SPI_PHASE_2EDGE                 SPI_CR1_CPHA
/**
  * @}
  */

/** @defgroup SPI_Slave_Select_management SPI Slave Select Management
  * @{
  */
#define SPI_NSS_SOFT                    SPI_CR1_SSM
#define SPI_NSS_HARD_INPUT              (0x00000000U)
#define SPI_NSS_HARD_OUTPUT             (SPI_CR2_SSOE << 16U)
/**
  * @}
  */

